## Plan Result (prod-idp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 4 to destroy.</code></pre>

* Update
  * azurerm_network_security_group.nsg
  * module.idp-kv.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_linux_virtual_machine.application
  * azurerm_linux_virtual_machine.trainer
  * azurerm_virtual_machine_data_disk_attachment.example
  * module.idp-poc-db.null_resource.set-user-permissions[0] is tainted, so




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine.application must be replaced
-/+ resource "azurerm_linux_virtual_machine" "application" {
      - availability_set_id             = "" -> null
      - capacity_reservation_group_id   = "" -> null
      ~ computer_name                   = "idp-poc-application" -> (known after apply)
      - dedicated_host_group_id         = "" -> null
      - dedicated_host_id               = "" -> null
      - edge_zone                       = "" -> null
      - encryption_at_host_enabled      = false -> null
      - eviction_policy                 = "" -> null
      ~ id                              = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Compute/virtualMachines/idp-poc-application" -> (known after apply)
      - license_type                    = "" -> null
        name                            = "idp-poc-application"
      ~ private_ip_address              = "10.131.1.100" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.131.1.100",
        ] -> (known after apply)
      - proximity_placement_group_id    = "" -> null
      ~ public_ip_address               = "" -> (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - source_image_id                 = "" -> null
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/idp-shared-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      - user_data                       = "" -> null
      ~ virtual_machine_id              = "60a21b13-e29f-45ad-9e13-4dfa3c77ac1b" -> (known after apply)
      - virtual_machine_scale_set_id    = "" -> null
      - vtpm_enabled                    = false -> null
      - zone                            = "" -> null
        # (13 unchanged attributes hidden)

      ~ admin_ssh_key { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ os_disk {
          ~ name                      = "idp-poc-application_OsDisk_1_20a92c19a37e4db3a38863db4fda9b67" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_virtual_machine.trainer must be replaced
-/+ resource "azurerm_linux_virtual_machine" "trainer" {
      - availability_set_id             = "" -> null
      - capacity_reservation_group_id   = "" -> null
      ~ computer_name                   = "idp-poc-trainer" -> (known after apply)
      - dedicated_host_group_id         = "" -> null
      - dedicated_host_id               = "" -> null
      - edge_zone                       = "" -> null
      - encryption_at_host_enabled      = false -> null
      - eviction_policy                 = "" -> null
      ~ id                              = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Compute/virtualMachines/idp-poc-trainer" -> (known after apply)
      - license_type                    = "" -> null
        name                            = "idp-poc-trainer"
      ~ private_ip_address              = "10.131.1.101" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.131.1.101",
        ] -> (known after apply)
      - proximity_placement_group_id    = "" -> null
      ~ public_ip_address               = "" -> (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - source_image_id                 = "" -> null
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/idp-shared-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      - user_data                       = "" -> null
      ~ virtual_machine_id              = "19b0dc37-94c5-4a0a-af13-482e81c3357f" -> (known after apply)
      - virtual_machine_scale_set_id    = "" -> null
      - vtpm_enabled                    = false -> null
      - zone                            = "" -> null
        # (13 unchanged attributes hidden)

      ~ admin_ssh_key { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ os_disk {
          ~ name                      = "idp-poc-trainer_OsDisk_1_c4e2ff5020d94e0ca0c23cac573a9934" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_network_security_group.nsg will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg" {
        id                  = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Network/networkSecurityGroups/idp_nsg"
        name                = "idp_nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "bastion"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.48.0.6/32"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "appw"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.131.1.160/27"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = null
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "10.48.0.6/32"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/idp-shared-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.example must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "example" {
      ~ id                        = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Compute/virtualMachines/idp-poc-application/dataDisks/idp-poc-application-disk1" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Compute/virtualMachines/idp-poc-application" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.idp-kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.KeyVault/vaults/idp-poc-prod|idp-poc-prod"
        name                       = "idp-poc-prod"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.idp-poc-db.null_resource.set-user-permissions[0] is tainted, so must be replaced
-/+ resource "null_resource" "set-user-permissions" {
      ~ id       = "4036803602469587093" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Target":"prod-idp","Vars":{}} -->